# PANDAS

Panel Data Analysis
Panel = rows and colums

Then it was renamed to Python Data Analysis

Data Analysis:- Inspecting, Understanding and Exploring on what is Data, How is the data and How the data ideally should be for making it relevent for further use.

Pandas is termed as EXCEL of python

# Data Structure of Pandas are Series and DataFrame


**Series:** 1) Series are 1-D array which can hold any kind of data.
            2) Series is given for 1 column in a dataset.

**DataFrame:** 1) It is a 2-D array which will hold data into rows and columns.
               2) Entire table/dataset is termed as a dataframe.

# Why we use Pandas

1) Pandas is a python library used for working with data sets.
2) It has functions for analysing, cleaning, exploring and manipulating data.
3) Pandas allows us to analyze data and make conclusions based on statistical theories observed from the data.
4) Having relevent data is very important for analysis.

In [1]:
import pandas as pd

In [2]:
?pd

In [3]:
pd.__version__

'2.0.3'

# Series - 1D arrays

It represents a column in a dataset series in pandas in a one-dimensional labeled array that can hold any data type - integers, floats, strings, etc

In [4]:
s1 = ["A","B","c","D","E"] #list
print(s1)
type(s1)

['A', 'B', 'c', 'D', 'E']

list

In [9]:
s1 = pd.Series(["A","B","c","D","E"])
print(s1)
type(s1)     # Only positive indexing

0    A
1    B
2    c
3    D
4    E
dtype: object

pandas.core.series.Series

In [ ]:
# Indexing and Slicing

In [12]:
s1[2]
#s1[-1]    Negative indexing will give error

'c'

In [16]:
s1[0:3]

0    A
1    B
2    c
dtype: object

In [14]:
s1[::]

0    A
1    B
2    c
3    D
4    E
dtype: object

In [ ]:
# Value assignment

In [19]:
s1[4] = "F"
s1

0    A
1    B
2    c
3    D
4    F
dtype: object

In [21]:
s1[5] = "G"
s1

0    A
1    B
2    c
3    D
4    F
5    G
dtype: object

# Labels

Syntax:- pd.Series(data, index=labels)

Labels are the index values of a Series - They identify each item

In [23]:
s2 = pd.Series(["A","B","C","D","E"], index = [100,101,102,103,104])   #fancy indexing
s2

100    A
101    B
102    C
103    D
104    E
dtype: object

In [7]:
import pandas as pd
s2 = pd.Series(["A","B","C","D","E"], index = [100,101,102,103,104])
print(s2)

100    A
101    B
102    C
103    D
104    E
dtype: object

In [ ]:
s2 [100] = "Di"   #Item assignment
s2["KkK"] = "kk"

In [8]:
Country =["USA","England","NewZeland","India", "Australia"]
Country_Code = [101,102,103,104,105]
data = pd.Series(Country,index=Country_Code)
print(data)

101          USA
102      England
103    NewZeland
104        India
105    Australia
dtype: object

In [11]:
data[106] = "Scotland"    # To Add a new value
data

101               USA
102           England
103         NewZeland
104             India
105         Australia
Scotland          106
106          Scotland
dtype: object

In [12]:
del data["Scotland"]      # To delete a Value

In [13]:
data

101          USA
102      England
103    NewZeland
104        India
105    Australia
106     Scotland
dtype: object

In [14]:
import numpy as np

In [15]:
arr_1 = np.array ([2,3,4,5,6])
arr_1

array([2, 3, 4, 5, 6])

In [16]:
# Convert this array into a series

s4 = pd.Series(arr_1)
print(s4)

0    2
1    3
2    4
3    5
4    6
dtype: int32

In [23]:
# As there are no labels we can do indexing with default index
print(s4[0])
print(s4[1])
print(s4[2])

2
3
4

In [25]:
# Slicing with index Number
print(s4[0:2])
print(s4[:3])
print(s4[1:])

0    2
1    3
dtype: int32
0    2
1    3
2    4
dtype: int32
1    3
2    4
3    5
4    6
dtype: int32

In [28]:
#Creating series from array with labels

arr_1 = np.array ([10,20,30,40,50])
s = pd.Series(arr_1, index=["a","b","c","d","e"])
print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [43]:
# Indexing with labels
# As we can see the indexing is not in the form of 0,1,2 but still when we give indexing as 0,1,2 
# it will consider it because in the backend the indexing is stored as 0,1,2
print(s[0])
print(s[2])
print(s[-1])

# When we use Label for slicing then Start value and End value both will be Inclusive
print(s["a":"c"])
print(s["b":"e"])
print(s["a":"e"])

# Using Step size
print(s["a":"c":2])
print(s["a":"d":3])

10
30
50
a    10
b    20
c    30
dtype: int32
b    20
c    30
d    40
e    50
dtype: int32
a    10
b    20
c    30
d    40
e    50
dtype: int32
a    10
c    30
dtype: int32
a    10
d    40
dtype: int32

In [30]:
# We can also do Slicing with series/indexing - start Inclusive, End Exclusive, Step
print(s[0:2:2])
print(s[1:4:3])
print(s[:3])
print(s[::2])

a    10
dtype: int32
b    20
dtype: int32
a    10
b    20
c    30
dtype: int32
a    10
c    30
e    50
dtype: int32

In [55]:
#Create a dictionary with one key and one value
D1= {"a":1, "b":2, "c":3}
print(D1)

{'a': 1, 'b': 2, 'c': 3}

In [64]:
# Convert Dictionary into series
s1 = pd.Series(D1)
s1

a    1
b    2
c    3
dtype: int64

In [61]:
#Indexing On Dictionary
print(s1[0])
print(s1[0:1])
print(s1["c"])

1
a    1
dtype: int64
3

In [66]:
# We will not get error even if the value of index doesn't match the value of keys
# it will take the input of the labels and show NaN as the value

s1 = pd.Series(D1, index=["e","f","g","h","i","c"])
s1

e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
c    3.0
dtype: float64

# Create a series from a scalar value(Single Value)

If the data is in scalar value, an index must be provided, the value will be repeated to match the length of the index

In [68]:
# Create a series from a scalar value
scalar_value = 10
index_values = ['a', 'b', 'c', 'd', 'e']
s = pd.Series(scalar_value, index=index_values)

print(s)
type(s)

a    10
b    10
c    10
d    10
e    10
dtype: int64

pandas.core.series.Series

In [69]:
#Create a Dictionary with one key and multiple value
my_dict = {"fruits": ["apple", "banana", "cherry"]}

print(my_dict)
print(my_dict["fruits"])

{'fruits': ['apple', 'banana', 'cherry']}
['apple', 'banana', 'cherry']

In [71]:
df = pd.DataFrame(my_dict)
df

   fruits
0   apple
1  banana
2  cherry

# DataFrame
Datasets in Pandas are usually 2 Dimensional. 
These 2 dimensional tables are known as DataFrame.
Series is just a column but the DataFrame is entire table.

In [73]:
# Creating Dictionary
students = {"Id": [101,102,103,104,105,106,107],
           "Name": ["Piyush","Mehvish","Neer","Prarthana","Abhishek","Sakshi","Ganesh"],
           "Age": np.random.randint(20,30,(7,)),
           "Location": ["Pune","Mumbai","Nepal","Jhansi","Khopoli","Pune","Bhusawal"]}
print(students)

{'Id': [101, 102, 103, 104, 105, 106, 107], 'Name': ['Piyush', 'Mehvish', 'Neer', 'Prarthana', 'Abhishek', 'Sakshi', 'Ganesh'], 'Age': array([27, 28, 25, 27, 22, 28, 23]), 'Location': ['Pune', 'Mumbai', 'Nepal', 'Jhansi', 'Khopoli', 'Pune', 'Bhusawal']}

In [74]:
df = pd.DataFrame(students)
df

    Id       Name  Age  Location
0  101     Piyush   27      Pune
1  102    Mehvish   28    Mumbai
2  103       Neer   25     Nepal
3  104  Prarthana   27    Jhansi
4  105   Abhishek   22   Khopoli
5  106     Sakshi   28      Pune
6  107     Ganesh   23  Bhusawal

In [76]:
df.index = [10,11,12,13,14,15,16]
df

     Id       Name  Age  Location
10  101     Piyush   27      Pune
11  102    Mehvish   28    Mumbai
12  103       Neer   25     Nepal
13  104  Prarthana   27    Jhansi
14  105   Abhishek   22   Khopoli
15  106     Sakshi   28      Pune
16  107     Ganesh   23  Bhusawal

In [77]:
df.index = ["a","b","c","d","e","f","g"]
df

    Id       Name  Age  Location
a  101     Piyush   27      Pune
b  102    Mehvish   28    Mumbai
c  103       Neer   25     Nepal
d  104  Prarthana   27    Jhansi
e  105   Abhishek   22   Khopoli
f  106     Sakshi   28      Pune
g  107     Ganesh   23  Bhusawal

In [78]:
# create a dictionary with mismatched value
data = {
    "Id": [101, 102, 103],
    "Name": ["Piyush", "Mehvish"],
    "Location": ["Pune", "Mumbai", "Delhi", "Goa"]}

print(data)

{'Id': [101, 102, 103], 'Name': ['Piyush', 'Mehvish'], 'Location': ['Pune', 'Mumbai', 'Delhi', 'Goa']}

In [80]:
#df = pd.DataFrame(data)    # This will give error as:- All arrays must be of the same length
#df                         # Dictionary will be created but can't convert into dataframe

In [85]:
# Create a dictionary with multiple one key and one value

students = {
    "Id": 101,
    "Name": "Piyush",
    "Age": 24,
    "Location": "Pune"}

print(students)

{'Id': [101], 'Name': 'Piyush', 'Age': 24, 'Location': 'Pune'}

In [88]:
#df = pd.DataFrame(students) 

# Converting the dict of 1 key value pair will give error
# ValueError:- If using all scalar values(single value), you must pass an index or declare a list

df = pd.DataFrame(students, index =["a"])
df

    Id    Name  Age Location
a  101  Piyush   24     Pune

In [91]:
# Creating an empty data frame

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [94]:
l1 = ["Name","Age","City","Department"]
print(l1)
type(l1)

['Name', 'Age', 'City', 'Department']

list

In [103]:
# Create empty DataFrame with columns

df = pd.DataFrame(columns=l1)   # Use 'columns' to create the col header
df

Empty DataFrame
Columns: [Name, Age, City, Department]
Index: []

In [105]:
df = df.append({"Name":"Piyush", "Age": 24, "City":"Pune", "Department":"IT"}, ignore_index = True)
df

# We are getting the error because in the new version of pandas append() is removed

AttributeError: 'DataFrame' object has no attribute 'append'

In [109]:
# We can add values using item assignment

df["Name"] = ["Piyush", "Mehvish",]
df["Age"] = [24, 22]
df["City"] = ["Pune","Mumbai"]
df["Department"] = ["IT", "CS"]

df

      Name  Age    City Department  Hobby
0   Piyush   24    Pune         IT      1
1  Mehvish   22  Mumbai         CS      1

In [110]:
# If you give single value in item assignment it will take for the entire label
df["Hobby"] = 1
df

      Name  Age    City Department  Hobby
0   Piyush   24    Pune         IT      1
1  Mehvish   22  Mumbai         CS      1

In [111]:
# If we want to fetch only limited values
df [["Age","Hobby"]]

   Age  Hobby
0   24      1
1   22      1

In [113]:
# Create a 2D array directly
arr_2d = [[1, 2, 3],
          [4, 5, 6],
          [7, 8, 9]]

print(arr_2d)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [115]:
data = [["Piyush", 24, "Pune"],
       ["Mehvish", 22, "Mumbai"]]
print(data)

df = pd.DataFrame(data)
df

[['Piyush', 24, 'Pune'], ['Mehvish', 22, 'Mumbai']]

         0   1       2
0   Piyush  24    Pune
1  Mehvish  22  Mumbai

In [116]:
df = pd.DataFrame(data, columns=["Name", "Age", "City"])
df

      Name  Age    City
0   Piyush   24    Pune
1  Mehvish   22  Mumbai

In [117]:
# Now if we want to change the name of col
# Chang column names directly

df.columns = ["First Name", "Age", "City"]

# df.columns = ["First Name", "City"]
# If the length doesn't match it will give error
df

  First Name  Age    City
0     Piyush   24    Pune
1    Mehvish   22  Mumbai

In [118]:
# Converting 3D array into Df

# 3D array: 2 blocks, each with 3 rows and 3 columns (Name, Age, City)

data1 = [[["Piyush", 24, "Pune"],
         ["Mehvish", 22, "Mumbai"],
         ["Neer", 24, "Pune"]],
        
        [["Prarthana", 23, "Jhansi"],
         ["Abhishek", 23, "Khopoli"],
        ["Ganesh", 19, "Bhusawal"]]]

print(data)
df1 = pd.DataFrame(data1)
df1
df1 = pd.DataFrame(data1, columns= ["Name", "Age", "City"])

df1

[['Piyush', 24, 'Pune'], ['Mehvish', 22, 'Mumbai']]

                      Name                      Age                    City
0       [Piyush, 24, Pune]    [Mehvish, 22, Mumbai]        [Neer, 24, Pune]
1  [Prarthana, 23, Jhansi]  [Abhishek, 23, Khopoli]  [Ganesh, 19, Bhusawal]

# Date:- 05/08/2025

In [3]:
import pandas as pd

dataloc = {
    "Employee": ["Piyush", "Mehvish", "Neer", "Prarthana", "Ganesh"],
    "Department": ["IT", "CS", "Finance", "HR", "Marketing"],
    "Age": [24,22,24,23,20],
    "Salary": [50000,45000,48000,35000,30000]
}

datal = pd.DataFrame(dataloc, index = ["E1", "E2", "E3", "E4", "E5"])

datal


# Whenever we want to use column for any operation we use "axis = 1" and 
# Whenever you want to select row for opeartion we use "axis = 0"

     Employee Department  Age  Salary
E1     Piyush         IT   24   50000
E2    Mehvish         CS   22   45000
E3       Neer    Finance   24   48000
E4  Prarthana         HR   23   35000
E5     Ganesh  Marketing   20   30000

# inplace = False (Temporary change - default) 
When we want to delete something or update something so it will be Temporary if we use "False"

# unplace = True (Permanent Change - need to specify)
When we want to delete something or update something so the changes will be Permanent if we use "True"

# Loc and iloc

**df.loc = location specific
  df.iloc = index location specific

- For accessing a DataFrame or fetching a value and set of value with respect to their index,
  we use either loc or iloc


**loc:-** loc take row label for accessing the data
Syntax loc - [start(inclusive):end(inclusive)]

**iloc:-** iloc will only take indexing for accessing the data

In [4]:
# Select a single rows by labels

datal.loc["E2"]   # Get Mehvish's Row

Employee      Mehvish
Department         CS
Age                22
Salary          45000
Name: E2, dtype: object

In [6]:
# Select multiple rows by labels

datal.loc[["E1", "E3", "E5"]]   # Get Piyush, Neer and Ganesh

   Employee Department  Age  Salary
E1   Piyush         IT   24   50000
E3     Neer    Finance   24   48000
E5   Ganesh  Marketing   20   30000

In [7]:
# Select specific rows and columns by label

datal.loc[["E1", "E3"], ["Employee","Salary"]]

   Employee  Salary
E1   Piyush   50000
E3     Neer   48000

In [8]:
# Slice by label range

datal.loc["E2":"E4", "Department":"Salary"]

   Department  Age  Salary
E2         CS   22   45000
E3    Finance   24   48000
E4         HR   23   35000

In [10]:
# Single row by position using iloc

datal.iloc[0:3]   # Row at position 1 (Mehvish) (inclusive)

# Equivalent loc: datal.loc["E2"]

   Employee Department  Age  Salary
E1   Piyush         IT   24   50000
E2  Mehvish         CS   22   45000
E3     Neer    Finance   24   48000

In [11]:
datal.iloc[[1]]
# 1 bracket [] (Series)

# 2 brackets [[]]  Table (DataFrame)

   Employee Department  Age  Salary
E2  Mehvish         CS   22   45000

In [13]:
# Multiple Rows by positions
datal.iloc[[0,3]]  # Rows at positions 0 and 3

# Equivalent loc: datal.loc[["E1", "E4"]]

     Employee Department  Age  Salary
E1     Piyush         IT   24   50000
E4  Prarthana         HR   23   35000

In [14]:
# Row Range (Slice)
datal.iloc[1:4]  # Rows at positions 1, 2, 3
# Equivalent loc: datal.loc["E2": "E4"]

     Employee Department  Age  Salary
E2    Mehvish         CS   22   45000
E3       Neer    Finance   24   48000
E4  Prarthana         HR   23   35000

In [15]:
datal

     Employee Department  Age  Salary
E1     Piyush         IT   24   50000
E2    Mehvish         CS   22   45000
E3       Neer    Finance   24   48000
E4  Prarthana         HR   23   35000
E5     Ganesh  Marketing   20   30000

In [16]:
# Single cell (Row & Column by position)

print(datal.iloc[2,3])   # Row 2, Column 3 salary of Neer

# Equivalent loc: datal.loc["E3", "Salary"]

48000

In [18]:
# Subset of Rows & Columns

print(datal.iloc[0:3, 0:2])   # First 3 rows, first 2 columns

# Equivalent loc: datal.loc["E1":"E3", ["Employee", "Department"]]

   Employee Department
E1   Piyush         IT
E2  Mehvish         CS
E3     Neer    Finance

In [20]:
# If we want to add an extra column in df

datal["Address"] = "India"    # Samen value for all rows
datal

     Employee Department  Age  Salary Address
E1     Piyush         IT   24   50000   India
E2    Mehvish         CS   22   45000   India
E3       Neer    Finance   24   48000   India
E4  Prarthana         HR   23   35000   India
E5     Ganesh  Marketing   20   30000   India

In [23]:
datal["City"] = " "   # Creates empty column
datal

     Employee Department  Age  Salary Address  City
E1     Piyush         IT   24   50000   India
E2    Mehvish         CS   22   45000   India
E3       Neer    Finance   24   48000   India
E4  Prarthana         HR   23   35000   India
E5     Ganesh  Marketing   20   30000   India

In [24]:
# For adding multiple values
datal["Address with City"] = ["Pune", "Mumbai", "Banglore", "Delhi", "Chennai"]
datal

     Employee Department  Age  Salary Address  City Address with City
E1     Piyush         IT   24   50000   India                    Pune
E2    Mehvish         CS   22   45000   India                  Mumbai
E3       Neer    Finance   24   48000   India                Banglore
E4  Prarthana         HR   23   35000   India                   Delhi
E5     Ganesh  Marketing   20   30000   India                 Chennai

In [25]:
# To update the value

datal["Address with City"] = ["Pune", "Mumbai", "Pune", "Jhansi", "Pune"]
datal

     Employee Department  Age  Salary Address  City Address with City
E1     Piyush         IT   24   50000   India                    Pune
E2    Mehvish         CS   22   45000   India                  Mumbai
E3       Neer    Finance   24   48000   India                    Pune
E4  Prarthana         HR   23   35000   India                  Jhansi
E5     Ganesh  Marketing   20   30000   India                    Pune

In [26]:
# If you change the column it values will remain intact only the columns will be changes using df.columns

datal.columns = ["Age", "Name", "Phone", "kkk", "cdafdaf", "hgdkv", "aufg"]
datal

          Age       Name  Phone    kkk cdafdaf hgdkv    aufg
E1     Piyush         IT     24  50000   India          Pune
E2    Mehvish         CS     22  45000   India        Mumbai
E3       Neer    Finance     24  48000   India          Pune
E4  Prarthana         HR     23  35000   India        Jhansi
E5     Ganesh  Marketing     20  30000   India          Pune

In [29]:
datal.columns = ["Employee", "Department", "Age", "Salary", "Address", "City", "Address with City"]  # For setting the col
datal

# After we set the col, then when we make changes both the value and col will be changed
datal = datal[["Address", "Department", "Employee", "Age", "Salary", "City", "Address with City"]]
datal

   Address Department   Employee  Age  Salary  City Address with City
E1   India         IT     Piyush   24   50000                    Pune
E2   India         CS    Mehvish   22   45000                  Mumbai
E3   India    Finance       Neer   24   48000                    Pune
E4   India         HR  Prarthana   23   35000                  Jhansi
E5   India  Marketing     Ganesh   20   30000                    Pune

In [31]:
datal["Score"] = [50, 40, 30, 20, 10]
datal

datal["RevisedScore"] = datal["Score"] + 5   # as it supports SIMD
datal

C:\Users\Dell\AppData\Local\Temp\ipykernel_14908\1766706479.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  datal["Score"] = [50, 40, 30, 20, 10]
C:\Users\Dell\AppData\Local\Temp\ipykernel_14908\1766706479.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  datal["RevisedScore"] = datal["Score"] + 5   # as it supports SIMD

,Address,Department,Employee,Age,Salary,City,Address with City,Score,RevisedScore
E1,India,IT,Piyush,24,50000,,Pune,50,55
E2,India,CS,Mehvish,22,45000,,Mumbai,40,45
E3,India,Finance,Neer,24,48000,,Pune,30,35
E4,India,HR,Prarthana,23,35000,,Jhansi,20,25
E5,India,Marketing,Ganesh,20,30000,,Pune,10,15

# Delete - del

- Removes a column permanently from the DataFrame (in-place)

- No return value - it directly modifies the DataFrame

- Works only for columns, not rows

Syntax: del df["ColumnName"]

# Drop

- Can remove rows or columns

- Returns a new DataFrame by default (Unless inplace = True)

- Needs axis or index / columns parameter

Syntax: 

Drop column: df.drop(columns = "Score")

Drop row: df.drop(index = "E5")

In [33]:
del datal["RevisedScore"]   # Removes column permanently - if you run again will get error
datal

   Address Department   Employee  Age  Salary  City Address with City  Score
E1   India         IT     Piyush   24   50000                    Pune     50
E2   India         CS    Mehvish   22   45000                  Mumbai     40
E3   India    Finance       Neer   24   48000                    Pune     30
E4   India         HR  Prarthana   23   35000                  Jhansi     20
E5   India  Marketing     Ganesh   20   30000                    Pune     10

In [34]:
datal.drop("E4")   # By default will take row
# E4-removed

   Address Department Employee  Age  Salary  City Address with City  Score
E1   India         IT   Piyush   24   50000                    Pune     50
E2   India         CS  Mehvish   22   45000                  Mumbai     40
E3   India    Finance     Neer   24   48000                    Pune     30
E5   India  Marketing   Ganesh   20   30000                    Pune     10

In [35]:
# But if we run df again the dropped value will be visible again
datal

   Address Department   Employee  Age  Salary  City Address with City  Score
E1   India         IT     Piyush   24   50000                    Pune     50
E2   India         CS    Mehvish   22   45000                  Mumbai     40
E3   India    Finance       Neer   24   48000                    Pune     30
E4   India         HR  Prarthana   23   35000                  Jhansi     20
E5   India  Marketing     Ganesh   20   30000                    Pune     10

In [38]:
# If trying to use drop with column will get error
#datal.drop("Score")   # Key Error: "["Score"] not found in axis"
# We need to specify axis

In [40]:
# With axis it will not give error

datal = datal.drop("Score", axis = 1)
datal

   Address Department   Employee  Age  Salary  City Address with City
E1   India         IT     Piyush   24   50000                    Pune
E2   India         CS    Mehvish   22   45000                  Mumbai
E3   India    Finance       Neer   24   48000                    Pune
E4   India         HR  Prarthana   23   35000                  Jhansi
E5   India  Marketing     Ganesh   20   30000                    Pune

In [41]:
# Using inplace = True will permanently remove
datal.drop("City", axis = 1, inplace = True)
datal

   Address Department   Employee  Age  Salary Address with City
E1   India         IT     Piyush   24   50000              Pune
E2   India         CS    Mehvish   22   45000            Mumbai
E3   India    Finance       Neer   24   48000              Pune
E4   India         HR  Prarthana   23   35000            Jhansi
E5   India  Marketing     Ganesh   20   30000              Pune

In [56]:
# We will use ".index" to solve this problem

datal.drop(datal[(datal["Department"] == "IT") & (datal["Age"] > 25)].index, inplace = True)
datal
# & - AND Operator
# | - OR Operator

   Address Department   Employee  Age  Salary Address with City
E2   India         CS    Mehvish   22   45000            Mumbai
E3   India    Finance       Neer   24   48000              Pune
E4   India         HR  Prarthana   23   35000            Jhansi
E5   India  Marketing     Ganesh   20   30000              Pune

In [57]:
import os
os.getcwd()    # cwd:- Current working directory

# import os - Loads the OS module, which lets python interact with your operating system (Folders, files, paths)
# os.getcwd() - Get current working directory
# getcwd stands for Get Current working directory
# It returns the folder path where python is currently running

'C:\\Users\\Dell\\Practiceset 1'

In [58]:
dataloc = {
    "Employee": ["Piyush", "Mehvish", "Neer", "Prarthana", "Ganesh"],
    "Department": ["IT", "CS", "Finance", "HR", "Marketing"],
    "Age": [24,22,24,23,20],
    "Salary": [50000,45000,48000,35000,30000]
}

df = pd.DataFrame(dataloc, index = ["E1", "E2", "E3", "E4", "E5"])
df

     Employee Department  Age  Salary
E1     Piyush         IT   24   50000
E2    Mehvish         CS   22   45000
E3       Neer    Finance   24   48000
E4  Prarthana         HR   23   35000
E5     Ganesh  Marketing   20   30000

In [62]:
# If we want to convert the dataframe that i have created in excel

df.to_csv('C:\\Users\\Dell\\Downloads\\mydata2.csv', index = False)  # index = True

# If we give index = True then it will save with indexing
# If we give index = False then it will save without indexing

In [63]:
# To convert into excel

df.to_excel('C:\\Users\\Dell\\Downloads\\sample.xlsx', index = True, header = True)

# We can check the file in downloads

In [64]:
# To convert into excel

df.to_excel('C:\\Users\\Dell\\Downloads\\sample2.xlsx', index = True, header = False) # Will not Take Header

In [65]:
# Use .copy() before transformations if you want to preserve the original dataset.
# also when you want to work on a seperate DataFrame without affecting the original one.

# names should be different
df_newcopy = df.copy()

# To Load the files

**Syntax:- df_loaded = pd.read_csv(file_path)

pd.read - Reads the CSV file

Creates a DataFrame (df_loaded)

Uses the first row of the csv as column headers (if header = True by default)
We need to provide "r" at the starting or \\ in the path so python doesn't get confused

In [66]:
# importing dataset without header

df_excel = pd.read_excel(r"C:\Users\Dell\Downloads\sample.xlsx")
df_excel

# We have not specified any col so 1st row will be considered as col

# names = [...] Tells Pandas exactly what column names to assign, ignoring whatever is in the Excel file. Like we did for col

  Unnamed: 0   Employee Department  Age  Salary
0         E1     Piyush         IT   24   50000
1         E2    Mehvish         CS   22   45000
2         E3       Neer    Finance   24   48000
3         E4  Prarthana         HR   23   35000
4         E5     Ganesh  Marketing   20   30000

# HOME ASSIGNMENT  05/08/2025

# Create a DataFrame named df_students for 6 students with the following columns:
StudentID Name SQL_Marks Python_Marks Excel_Marks Address Tier

**Q1:- Calculate the total marks of SQl, Python, Excel and add as a new column

**Q2:- Calculate the average marks and add as a new column

**Q3:- Fetch all the students from Tier 1

**Q4:- Fetch Details of students at the second Index Using Label

**Q5:- Fetch name and average marks of student at 2nd and 4th index with label

**Q6:- Using index Fetch details of the students in 2nd Row

**Q7:- Using index fetch name and total marks of 1st and 4th student

**Q8:- Fetch Rows from index 0 to 2 and Column index 1 to 4

**Q9:- Fetch Name and tier for every alternate student with labels

**Q10:- Fetch name and average marks for students in reverse order

In [15]:
# Create a DataFrame named df_students for 6 students with the following columns:
# StudentID Name SQL_Marks Python_Marks Excel_Marks Address Tier

import pandas as pd

data = {
    "StudentID": [101, 102, 103, 104, 105, 106],
    "Name": ["Piyush", "Mehvish", "Neer", "Prarthana", "Ganesh", "Abhishek"],
    "SQL_Marks": [91, 85, 92, 74, 88, 80],
    "Python_Marks": [92, 90, 85, 70, 89, 70],
    "Excel_Marks": [93, 80, 90, 72, 85, 71],
    "Address": ["Pune", "Mumbai", "Pune", "Jhansi", "Bhusawal", "Khopoli"],
    "Tier": ["Tier 1", "Tier 1", "Tier 2", "Tier 2", "Tier 3", "Tier 3"]
}

df_students = pd.DataFrame(data)
df_students

,StudentID,Name,SQL_Marks,Python_Marks,Excel_Marks,Address,Tier
0,101,Piyush,91,92,93,Pune,Tier 1
1,102,Mehvish,85,90,80,Mumbai,Tier 1
2,103,Neer,92,85,90,Pune,Tier 2
3,104,Prarthana,74,70,72,Jhansi,Tier 2
4,105,Ganesh,88,89,85,Bhusawal,Tier 3
5,106,Abhishek,80,70,71,Khopoli,Tier 3

In [16]:
# Q1:- Calculate total marks and add as new column

df_students["Total Marks"] = df_students["SQL_Marks"] + df_students["Python_Marks"] + df_students["Excel_Marks"]
df_students

,StudentID,Name,SQL_Marks,Python_Marks,Excel_Marks,Address,Tier,Total Marks
0,101,Piyush,91,92,93,Pune,Tier 1,276
1,102,Mehvish,85,90,80,Mumbai,Tier 1,255
2,103,Neer,92,85,90,Pune,Tier 2,267
3,104,Prarthana,74,70,72,Jhansi,Tier 2,216
4,105,Ganesh,88,89,85,Bhusawal,Tier 3,262
5,106,Abhishek,80,70,71,Khopoli,Tier 3,221

In [18]:
# Without using .mean

df_students["Average_Marks"] = (
    (df_students["SQL_Marks"] + df_students["Python_Marks"] + df_students["Excel_Marks"]) / 3)

df_students

,StudentID,Name,SQL_Marks,Python_Marks,Excel_Marks,Address,Tier,Total Marks,Average Marks,Average_Marks
0,101,Piyush,91,92,93,Pune,Tier 1,276,92.000000,92.000000
1,102,Mehvish,85,90,80,Mumbai,Tier 1,255,85.000000,85.000000
2,103,Neer,92,85,90,Pune,Tier 2,267,89.000000,89.000000
3,104,Prarthana,74,70,72,Jhansi,Tier 2,216,72.000000,72.000000
4,105,Ganesh,88,89,85,Bhusawal,Tier 3,262,87.333333,87.333333
5,106,Abhishek,80,70,71,Khopoli,Tier 3,221,73.666667,73.666667

In [7]:
# Q3:- Fetch all students from Tier 1

tier1_students = df_students[df_students["Tier"]=="Tier 1"]
tier1_students

,StudentID,Name,SQL_Marks,Python_Marks,Excel_Marks,Address,Tier,Total Marks,Average Marks
0,101,Piyush,91,92,93,Pune,Tier 1,276,92.0
1,102,Mehvish,85,90,80,Mumbai,Tier 1,255,85.0

In [15]:
# Q5:- Fetch details of student at 2nd index using label

df_students.loc[[2]]

,StudentID,Name,SQL_Marks,Python_Marks,Excel_Marks,Address,Tier,Total Marks,Average Marks
2,103,Neer,92,85,90,Pune,Tier 2,267,89.0

In [9]:
# Q5:- Fetch name and average marks of student at 2nd and 4th index using label

df_students.loc[[2,4], ["Name","Average Marks"]]

     Name  Average Marks
2    Neer      89.000000
4  Ganesh      87.333333

In [13]:
# Q6:- Using index fetch details of student in 2nd row

df_students.iloc[[2]]

,StudentID,Name,SQL_Marks,Python_Marks,Excel_Marks,Address,Tier,Total Marks,Average Marks
2,103,Neer,92,85,90,Pune,Tier 2,267,89.0

In [16]:
# Q7:- Using index fetch name and total marks of 1st and 4th student

df_students.iloc[[0,3], [1, 7]]

        Name  Total Marks
0     Piyush          276
3  Prarthana          216

In [17]:
# Q8:- Fetch rows from index 0 to 2 and column index 1 to 4

df_students.iloc[0:3, 1:5]

      Name  SQL_Marks  Python_Marks  Excel_Marks
0   Piyush         91            92           93
1  Mehvish         85            90           80
2     Neer         92            85           90

In [18]:
# Q9:- Fetch name and tier for every alternate student with labels

df_students.loc[::2, ["Name","Tier"]]

     Name    Tier
0  Piyush  Tier 1
2    Neer  Tier 2
4  Ganesh  Tier 3

In [20]:
# Q10:- Fetch name and average marks for students in reverse order

df_students.loc[::-1, ["Name","Average Marks"]]

        Name  Average Marks
5   Abhishek      73.666667
4     Ganesh      87.333333
3  Prarthana      72.000000
2       Neer      89.000000
1    Mehvish      85.000000
0     Piyush      92.000000

# Date:- 06/08/2025

In [1]:
import pandas as pd

In [2]:
# import Excel Files:- We just have to copy the path of the file and paste after this df_excel = pd.read_excel

df_excel = pd.read_excel(r"C:\Users\Dell\Downloads\Datasets PYTHON 62\Datasets\bigmarket.xlsx")

In [3]:
df_excel

    Month Store  Sales
0     Jan     A  27798
1     Jan     B  21656
2     Jan     C  28277
3     Jan     D  30029
4     Jan     E  44691
5     Feb     A  30021
6     Feb     B  39378
7     Feb     C  47613
8     Feb     D  21795
9     Feb     E  44208
10  March     A  39599
11  March     B  48685
12  March     C  48825
13  March     D  29641
14  March     E  27211
15    Apr     A  41434
16    Apr     B  47535
17    Apr     C  28929
18    Apr     D  32619
19    Apr     E  43151
20    May     A  25281
21    May     B  47258
22    May     C  45273
23    May     D  45511
24    May     E  30319

In [4]:
# Import csv files

df_csv = pd.read_csv(r"C:\Users\Dell\Downloads\Datasets PYTHON 62\Datasets\bigmarket.csv")

In [5]:
df_csv

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [6]:
# For text we will use the csv format

# If values are comma separated
df_txt = pd.read_csv(r"C:\Users\Dell\Downloads\Datasets PYTHON 62\Datasets\bigmarket.txt")

# But in the output the data will show as a single value but separated by '\' - data can't be used
df_txt

# We will use delimiter to solve this problem

   Month\tStore\tSales
0        Jan\tA\t31037
1        Jan\tB\t20722
2        Jan\tC\t24557
3        Jan\tD\t34649
4        Jan\tE\t29795
5        Feb\tA\t29133
6        Feb\tB\t22695
7        Feb\tC\t28312
8        Feb\tD\t31454
9        Feb\tE\t46267
10     March\tA\t32961
11     March\tB\t26451
12     March\tC\t47814
13     March\tD\t36069
14     March\tE\t31874
15       Apr\tA\t27253
16       Apr\tB\t40241
17       Apr\tC\t47488
18       Apr\tD\t25432
19       Apr\tE\t33880
20       May\tA\t29487
21       May\tB\t40001
22       May\tC\t46482
23       May\tD\t46313
24       May\tE\t47594

# Delimiter
**A delimiter tells python how the values in the file are separated
  Common Delimiters:- 
  
1) , - Comma separated (default for csv)
2) \t - Tab separated (TXT files from Excel or reports)
3) ; - Semicolon separated (Common in Europe)
4) | - Pipe separated

In [7]:
# In our data it is separated by \ so we will use \t

df_txt = pd.read_csv(r"C:\Users\Dell\Downloads\Datasets PYTHON 62\Datasets\bigmarket.txt", 
                    delimiter = "\t")   # t stands for Tab

df_txt

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [ ]:
# Load JSON File
# If you have a json file then use pd.json
# df_json = pd.read_json = (r" PATH ")

In [10]:
# The Clipboard method in Pandas lets you
# Directly copy and paste data between your clipboard (what you copy with ctrl + c) and a pandas DataFrame

df = pd.read_clipboard()
print(df)

# Pandas reads whatever is in your clipboard
# It assumes the copied content is tabular (rows & columns)
# It converts it into a DataFrame

  Month Store  Sales
0   Jan     A  31037
1   Jan     B  20722
2   Jan     C  24557
3   Jan     D  34649
4   Jan     E  29795
5   Feb     A  29133
6   Feb     B  22695
7   Feb     C  28312
8   Feb     D  31454

In [11]:
import seaborn as sns

# Seaborn actually comes with several built-in datasets (Like tips, iris, Flights) that we can load and check

In [12]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [13]:
# To load the dataset

df_flights = sns.load_dataset("flights")
df_flights

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]